In [1]:
#Q1

In [82]:
import pandas as pd

In [12]:
pd.read_csv()

TypeError: read_csv() missing 1 required positional argument: 'filepath_or_buffer'

In [11]:
pd.plot(df)

AttributeError: module 'pandas' has no attribute 'plot'

In [13]:
#mean, stdm describe, loc, iloc

SyntaxError: invalid syntax (441258233.py, line 1)

In [14]:
#Q2

In [42]:
df = pd.DataFrame({"A" : (1,2,3), "B" : (1,2,3), "C": (1,2,3)},index)

In [31]:
pd.reset_index(df)[1,3,5]

AttributeError: module 'pandas' has no attribute 'reset_index'

In [32]:
index = [1,3,5]

In [38]:
df.reset_index(inplace = True,drop = True)

In [43]:
df

   A  B  C
1  1  1  1
3  2  2  2
5  3  3  3

In [45]:
df = pd.DataFrame({"item" : ("biscuit","Coeffe","tea","green-tea","black-tea"), "Value" : (10,20,30,40,50)})

In [46]:
|

SyntaxError: invalid syntax (525519296.py, line 1)

        item  Value
0    biscuit     10
1     Coeffe     20
2        tea     30
3  green-tea     40
4  black-tea     50

In [58]:
z = 0
sum = 0
for Value in df.iterrows():
    if (z<4):
        sum = sum + Value
        z = z+1

TypeError: unsupported operand type(s) for +: 'int' and 'tuple'

In [55]:
for Value in df.items():
    print(Value)

('item', 0      biscuit
1       Coeffe
2          tea
3    green-tea
4    black-tea
Name: item, dtype: object)
('Value', 0    10
1    20
2    30
3    40
4    50
Name: Value, dtype: int64)

In [60]:

###
#######Q4

In [69]:
df["word_count"] = (df.item).apply(len)

In [75]:
df

        item  Value  word_count
0    biscuit     10           7
1     Coeffe     20           6
2        tea     30           3
3  green-tea     40           9
4  black-tea     50           9

In [71]:
######## Q5

In [76]:
# df.size() gives total number of elements in the data frame
df.size()

TypeError: 'int' object is not callable

In [77]:
df.shape()

TypeError: 'tuple' object is not callable

In [78]:
#Q6

In [80]:
pd.read_excel("dsd")

FileNotFoundError: [Errno 2] No such file or directory: 'dsd'

In [81]:
###Q7

In [92]:
data1 = {"Name" : ("nitesh","Anitesh","Bnitesh"), "Email" : ("dahkh.dsds@gmail.com","dsajh@gmail.com","dgsuh@gmail.com")}

In [85]:
data1

{'Name': ('nitesh', 'Anitesh', 'Bnitesh'),
 'Email': ('dahkh@gmail.com', 'dsajh@gmail.com', 'dgsuh@gmail.com')}

In [93]:
df123 = pd.DataFrame(data1)

In [94]:
df123

      Name                 Email
0   nitesh  dahkh.dsds@gmail.com
1  Anitesh       dsajh@gmail.com
2  Bnitesh       dgsuh@gmail.com

In [95]:
df123['new'] = df123['Email'].str.split('@').str[0]

In [96]:
df123

      Name                 Email         new
0   nitesh  dahkh.dsds@gmail.com  dahkh.dsds
1  Anitesh       dsajh@gmail.com       dsajh
2  Bnitesh       dgsuh@gmail.com       dgsuh

In [97]:
#Q8

In [99]:
df = pd.DataFrame({"A" : (1,2,3,54,4554), "B" : (1,2,3,43,32), "C": (1,322,233,34,232)})

In [100]:
df

      A   B    C
0     1   1    1
1     2   2  322
2     3   3  233
3    54  43   34
4  4554  32  232

In [112]:
df2 = df[(df['A'] > 5) & (df['B'] > 10)]

In [113]:
df2

      A   B    C
3    54  43   34
4  4554  32  232

In [ ]:
#Q9

In [114]:
df['A'].mean()

922.8

In [116]:
df['B'].median()

3.0

In [117]:
df['C'].mode()

0      1
1     34
2    232
3    233
4    322
Name: C, dtype: int64

In [118]:
#Q10

In [119]:
df

      A   B    C
0     1   1    1
1     2   2  322
2     3   3  233
3    54  43   34
4  4554  32  232

In [133]:
df['neew'] = df['A'].rolling(window = 3).sum()/3

In [134]:
df

      A   B    C         neew
0     1   1    1          NaN
1     2   2  322          NaN
2     3   3  233     2.000000
3    54  43   34    19.666667
4  4554  32  232  1537.000000

In [135]:
#Q11

In [144]:
df_date = pd.DataFrame({"date1" : ("2023-01-01","2023-01-02","2023-01-03","2023-01-04")})

In [145]:
df_date

        date1
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04

In [152]:
type[df_date.date1]

type[0    2023-01-01
1    2023-01-02
2    2023-01-03
3    2023-01-04
Name: date1, dtype: object]

In [156]:
df_date['weekk'] = df_date['date1'].dt.weekday()

AttributeError: Can only use .dt accessor with datetimelike values

In [139]:
df_date

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04

In [153]:
 import datetime